In [1]:
!python --version

Python 3.9.5

In [2]:
!pip install helpsk --upgrade

Requirement already satisfied: helpsk in /Users/shanekercheval/opt/anaconda3/envs/python-examples/lib/python3.9/site-packages (0.0.6)

In [3]:
import pandas as pd
from helpsk import string

In [4]:
string.collapse('a', 'b', 'c')

'abc'

In [5]:
string.collapse('a', 'b', 'c', surround="'", separate=",")

"'a','b','c'"

In [6]:
from helpsk import validation as vld
vld.assert_true(True)
vld.assert_false(False)

In [7]:
from helpsk import ExampleClass
example = ExampleClass()
example.my_variable

getter of my_variable called

0

# `is` vs `==`

`==` is an equality test. It checks whether the right hand side and the left hand side are equal objects (according to their __eq__ or __cmp__ methods.)

is is an identity test. It checks whether the right hand side and the left hand side are the very same object. No methodcalls are done, objects can't influence the is operation.

You use `is` (and `is not`) for `singletons`, like `None`, where you don't care about objects that might want to pretend to be None or where you want to protect against objects breaking when being compared against None.

# List & DataFrame Equality

In [8]:
[1, 2, 3] == [1, 2, 3]

True

In [9]:
[1, 2, 3] == [1, 2, 3.00001]

False

In [10]:
['a', 'b', 'c'] == ['a', 'b', 'c']

True

In [11]:
['a', 'b', None] == ['a', 'b', None]

True

In [12]:
['a', 'b', 'c'] == ['a', 'b', None]

False

In [13]:
pd.DataFrame([[1, 2], [2, 3]]).equals(pd.DataFrame([[1, 2], [2, 3]]))

True

In [14]:
pd.DataFrame([[1, 2], [2, 3]]).equals(pd.DataFrame([[1, 2], [2, 3.001]]))

False

In [15]:
pd.DataFrame([[1, None], [2, 3.001]]).equals(pd.DataFrame([[1, None], [2, 3.001]]))

True

# Checking for Empty Containers

In [16]:
a = []

len(a) == 0  # not Pythonic

True

In [17]:
not a  # Pythonic

True

In [18]:
if len(a) == 0:
    print('Not Pythonic')

if not a:
    print('Pythonic')

Not Pythonic
Pythonic

In [19]:
a = ['a']

if len(a) != 0:
    print('Not Pythonic')

if a:
    print('Pythonic')

Not Pythonic
Pythonic

# Multi-lines

In [20]:
# not Pythonic
a = 1 + \
    2
print(a)

a = (1 +  # Pythonic
     2)
print(a)

3
3

# Classes

## Private vs Protected

In [32]:
class Example:
    def __init__(self):
        self.__private_variable = 'private'
        self._protected_variable = 'protected'
    
    def instance_method(self):
        return 'instance method ' + self.__private_variable + self._protected_variable
    
    @staticmethod
    def static_method(x):
        return 'static method ' + x
    
    @classmethod
    def class_method(cls, x):
        return 'class method ' + x

In [33]:
ex = Example()
ex._protected_variable

'protected'

In [34]:
try:
  print(ex.__private_variable)
except Exception as e:
  print(e)

'Example' object has no attribute '__private_variable'

In [35]:
ex._Example__private_variable

'private'

In [36]:
ex.instance_method()

'instance method privateprotected'

In [37]:
ex.static_method('a')  # not sure how this is useful

'static method a'

In [38]:
Example.class_method('a')  # no instance

'class method a'

## Getters / Setters

In [4]:
class ExampleClass:

    def __init__(self, my_variable=0):
        self._my_variable = my_variable

    @property
    def my_variable(self):
        """I'm the 'my_variable' property."""
        print("getter of my_variable called")
        return self._my_variable

    @my_variable.setter
    def my_variable(self, value):
        print("setter of my_variable called")
        self._my_variable = value

In [5]:
example = ExampleClass()
example.my_variable == 0

getter of my_variable called

True

In [6]:
example.my_variable = 0

setter of my_variable called

# Default Arguments

Pythonâ€™s default arguments are evaluated once when the function is defined, not each time the function is called (like it is in say, Ruby). This means that if you use a mutable default argument and mutate it, you will and have mutated that object for all future calls to the function as well.
	* http://docs.python-guide.org/en/latest/writing/gotchas/
	* This means you cannot assign objects as default arguments

# Pandas

In [52]:
import numpy as np
import pandas as pd

dates = pd.date_range("20210809", periods=6)
df = pd.DataFrame(np.random.randn(6, 4),
                  index=dates,
                  columns=list("ABCD"))

In [53]:
dates

DatetimeIndex(['2021-08-09', '2021-08-10', '2021-08-11', '2021-08-12',
               '2021-08-13', '2021-08-14'],
              dtype='datetime64[ns]', freq='D')

In [54]:
df

                   A         B         C         D
2021-08-09  0.190130 -1.193962  1.228019 -2.496885
2021-08-10  0.139202 -0.329785 -0.222718  0.184027
2021-08-11  0.857693 -0.406201  0.811340  0.972035
2021-08-12 -0.264159 -0.151768  0.074888 -1.481625
2021-08-13  0.403782  0.257263  0.059071 -0.437980
2021-08-14  0.843702 -0.972286 -0.500197  0.714293

In [57]:
# axis 0 indicates column-wise operations
df.apply(lambda x: x.mean(), axis=0)

A    0.361725
B   -0.466123
C    0.241734
D   -0.424356
dtype: float64

## Copy by Reference

In [39]:
df_2 = df

In [40]:
df.iat[0, 0] = np.nan

In [41]:
df.iloc[0, :]

A         NaN
B    0.083380
C   -1.262269
D   -0.465193
Name: 2021-08-09 00:00:00, dtype: float64

In [42]:
df_2.iloc[0, :]

A         NaN
B    0.083380
C   -1.262269
D   -0.465193
Name: 2021-08-09 00:00:00, dtype: float64

### Use `.copy()` for deep copy

In [43]:
df_2 = df.copy()

In [44]:
df.iat[0, 1] = np.nan

In [45]:
df.iloc[0, :]

A         NaN
B         NaN
C   -1.262269
D   -0.465193
Name: 2021-08-09 00:00:00, dtype: float64

In [46]:
df_2.iloc[0, :]

A         NaN
B    0.083380
C   -1.262269
D   -0.465193
Name: 2021-08-09 00:00:00, dtype: float64

## Selection

In [47]:
df.A

2021-08-09         NaN
2021-08-10   -0.887558
2021-08-11    2.166489
2021-08-12   -0.936240
2021-08-13   -0.742352
2021-08-14    0.441767
Freq: D, Name: A, dtype: float64

In [48]:
df['A']  # all rows of single column

2021-08-09         NaN
2021-08-10   -0.887558
2021-08-11    2.166489
2021-08-12   -0.936240
2021-08-13   -0.742352
2021-08-14    0.441767
Freq: D, Name: A, dtype: float64

In [49]:
df[0:1]  # slices rows; excludes last index

             A   B         C         D
2021-08-09 NaN NaN -1.262269 -0.465193

In [50]:
df[['A']]

                   A
2021-08-09       NaN
2021-08-10 -0.887558
2021-08-11  2.166489
2021-08-12 -0.936240
2021-08-13 -0.742352
2021-08-14  0.441767

If passing a single value to `.loc`, a Series is returned; if passing a list to `.loc` a DataFrame is returned

In [51]:
df.loc[pd.to_datetime('2021-08-09')]

A         NaN
B         NaN
C   -1.262269
D   -0.465193
Name: 2021-08-09 00:00:00, dtype: float64

In [52]:
df.loc[[pd.to_datetime('2021-08-09')]]

             A   B         C         D
2021-08-09 NaN NaN -1.262269 -0.465193

In [53]:
df.loc[[pd.to_datetime('2021-08-09'), pd.to_datetime('2021-08-10')]]

                   A         B         C         D
2021-08-09       NaN       NaN -1.262269 -0.465193
2021-08-10 -0.887558 -2.356643 -1.841870  1.643564

### `at` vs `loc`

- `df.at` is faster
- `df.at` can only access a single value at a time.
- `df.loc` can select multiple rows and/or columns.


https://stackoverflow.com/questions/37216485/pandas-at-versus-loc

## Get

method that allows you to index on a collection and return default value if the index is out of range

### Dictionary

In [135]:
{'a': 1, 'b': 2}.get('c') is None

True

In [136]:
{'a': 1, 'b': 2}.get('c', 0)

0

In [137]:
# ['c'] raises KeyError
from helpsk import validation
validation.raises_exception(lambda: {'a': 1, 'b': 2}['c'], KeyError)

True

### Series

In [64]:
dates[0]

Timestamp('2021-08-09 00:00:00', freq='D')

In [68]:
df.D.get(dates[0])

-0.46519296263591375

In [74]:
df.D.get(pd.date_range('2021-01-01', periods=1)[0]) is None

True

In [75]:
df.D.get(pd.date_range('2021-01-01', periods=1)[0], np.NaN)

nan

## Vectorized Operations - Automatic Alignment

A key difference between Series and ndarray is that operations between Series automatically align the data based on label. Thus, you can write computations without giving consideration to whether the Series involved have the same labels.

https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#vectorized-operations-and-label-alignment-with-series

In [79]:
s1 = pd.Series([1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])
s2 = pd.Series([10, 20, 30, 40, 50], index=['A', 'B', 'C', 'D', 'E'])

s1 + s2

A    11
B    22
C    33
D    44
E    55
dtype: int64

In [94]:
print(s1.iloc[[4, 3, 2, 1, 0]])
s + s2

E    5
D    4
C    3
B    2
A    1
dtype: int64

A    11
B    22
C    33
D    44
E    55
dtype: int64

The result of an operation between unaligned Series will have the union of the indexes involved. If a label is not found in one Series or the other, the result will be marked as missing NaN.

In [98]:
s.iloc[[2, 3, 4]] + s2.iloc[[0, 1, 2, 3]]

A     NaN
B     NaN
C    33.0
D    44.0
E     NaN
dtype: float64

## Applying Functions

https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#function-application

### Tablewise function application - Chaining Function Calls with `pipe()`

In [147]:
df_p = pd.DataFrame({"city_and_code": ["Chicago, IL", "Seattle, WA"]})
df_p

  city_and_code
0   Chicago, IL
1   Seattle, WA

In [144]:
df_p["city_and_code"].str.split(",")

0    [Chicago,  IL]
1    [Seattle,  WA]
Name: city_and_code, dtype: object

In [145]:
df_p["city_and_code"].str.split(",").str.get(1)

0     IL
1     WA
Name: city_and_code, dtype: object

In [148]:
def extract_city_name(df):
    """
    Chicago, IL -> Chicago for city_name column
    """
    df["city_name"] = df["city_and_code"].str.split(",").str.get(0)
    return df

def add_country_name(df, country_name=None):
    """
    Chicago -> Chicago-US for city_name column
    """
    col = "city_name"
    df["city_and_country"] = df[col] + country_name
    return df

In [149]:
df_p.pipe(extract_city_name).pipe(add_country_name, country_name="US")

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS
1   Seattle, WA   Seattle        SeattleUS

Python is pass by reference, so, unlike R, the DataFrame changes without having to make final assignment back into `df_p`. Instaed of returning the DataFrame object we are returning a pointer do the object.

In [153]:
df_p

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS
1   Seattle, WA   Seattle        SeattleUS

## Pandas Aggregations

In [40]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'col1':['a','a','a','a','a','b','b','b','b','b'],
    'col2':[10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
    'col3':[100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
})

### Use `.agg()` for simple functions on single columns

Meaning, there isn't any interaction between columns. (i.e. can't do `col2 + col3`)

In [41]:
data.groupby('col1').agg({'col2': [min, max], 'col3': [min, np.median, max]})

     col2      col3
      min  max  min median   max
col1
a      10   50  100  300.0   500
b      60  100  600  800.0  1000

### Use .apply() to create interaction among multiple columns

https://stackoverflow.com/questions/10951341/pandas-dataframe-aggregate-function-using-multiple-columns

In [42]:
data

  col1  col2  col3
0    a    10   100
1    a    20   200
2    a    30   300
3    a    40   400
4    a    50   500
5    b    60   600
6    b    70   700
7    b    80   800
8    b    90   900
9    b   100  1000

R Equivalent (although not quite because we don't get to name the column; column is `col1`, not `result_a`):

```
data %>%
    group_by(col1) %>%
    summarise(result_a = sum(col2 * col3))
```

In [43]:
grouped = data.groupby('col1')

def my_function(group):
    col2 = group['col2']
    col3 = group['col3']
    return (col2 * col3).sum()

result = grouped.apply(my_function)
result

col1
a     55000
b    330000
dtype: int64

In [44]:
result['b']

330000

---

Let's remove the .sum() and just multiply across groups, to see what the result is.

In [45]:
grouped = data.groupby('col1')

def my_function(group):
    col2 = group['col2']
    col3 = group['col3']
    return (col2 * col3)#.sum()

result = grouped.apply(my_function)
result

col1
a     0      1000
      1      4000
      2      9000
      3     16000
      4     25000
b     5     36000
      6     49000
      7     64000
      8     81000
      9    100000
dtype: int64

---

### `group_by(...) %>% summarise(...)`

The following examples shows the equivalent of R's `group_by(...) %>% summarise(...)`

https://stackoverflow.com/questions/14529838/apply-multiple-functions-to-multiple-groupby-columns

Unlike the last examples, we can A) name the columns and B) interact the grouped columns.

In [48]:
data

  col1  col2  col3
0    a    10   100
1    a    20   200
2    a    30   300
3    a    40   400
4    a    50   500
5    b    60   600
6    b    70   700
7    b    80   800
8    b    90   900
9    b   100  1000

In [50]:
def f(x):
    d = {}
    d['result_a'] = (x['col2'] * x['col3']).sum()
    d['result_b'] = x['col2'].sum() * x['col3'].sum()
    d['result_c'] = x['col2'] + x['col3']
    d['count'] = x.shape[0]
    d['col2_max'] = x['col2'].max()
    d['col3_max'] = x['col3'].max()
    return pd.Series(d)

data.groupby('col1').apply(f)

,result_a,result_b,result_c,count,col2_max,col3_max
col1,,,,,,
a,55000,225000,5 110 6 220 7 330 8 440 9 550 d...,5,50,500
b,330000,1600000,5 660 6 770 7 880 8 990 9 1...,5,100,1000

which is equivalent to:

```
data %>%
    group_by(col1) %>%
    summarise(result_a = sum(col2 * col3),
              result_b = sum(col2) * sum(col3),
              ...)
```

### `group_by(...) %>% mutate(...)`

https://gist.github.com/conormm/fd8b1980c28dd21cfaf6975c86c74d07


```
df %>% group_by(group) %>% mutate(mean_var1 = mean(var1))  # R
```

In [62]:
df = pd.DataFrame(data = {'group': ['A', 'A', 'B', 'B'], 'var1': [1, 4, 2, 2]})
df.assign(mean_var1 = lambda x: x.groupby('group')['var1'].transform('mean'))

  group  var1  mean_var1
0     A     1        2.5
1     A     4        2.5
2     B     2        2.0
3     B     2        2.0

In [66]:
df.groupby('group')['var1'].transform('mean')

0    2.5
1    2.5
2    2.0
3    2.0
Name: var1, dtype: float64

## Misc

In [214]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [215]:
s.str.capitalize()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

## Performance

Accelerated operations

https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#accelerated-operations


pandas has support for accelerating certain types of binary numerical and boolean operations using the numexpr library and the bottleneck libraries.

These libraries are especially useful when dealing with large data sets, and provide large speedups. numexpr uses smart chunking, caching, and multiple cores. bottleneck is a set of specialized cython routines that are especially fast when dealing with arrays that have nans.

Here is a sample (using 100 column x 100,000 row DataFrames):

Operation
0.11.0 (ms)
Prior Version (ms)
Ratio to Prior
df1 > df2
13.32
125.35
0.1063
df1 * df2
21.71
36.63
0.5928
df1 + df2
22.04
36.50
0.6039
You are highly encouraged to install both libraries. See the section Recommended Dependencies for more installation info.

These are both enabled to be used by default, you can control this by setting the options:

pd.set_option("compute.use_bottleneck", False)
pd.set_option("compute.use_numexpr", False)

# Unexpected Behavior

## Operations in general exclude missing data.

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#stats

In [209]:
df = pd.DataFrame(np.random.randn(6, 4),
                  columns=list("ABCD"))
df.iat[0, 0] = np.nan
df

          A         B         C         D
0       NaN -1.343106  0.025455  1.477582
1  1.626082  0.544241  0.620942 -0.736149
2 -1.478041  0.230491  0.426075  0.834510
3 -0.301862 -0.107032  1.058098  0.710978
4 -0.903349  1.558083  1.192531 -1.554701
5 -0.325039  0.857985 -0.200452 -0.661910

In [212]:
df.mean()  # this works; R equivalent would have returned `NA`

A   -0.276442
B    0.290110
C    0.520442
D    0.011719
dtype: float64

In [213]:
df.mean(skipna=False)  # have to manually set skipna=False to get desired behavior

A         NaN
B    0.290110
C    0.520442
D    0.011719
dtype: float64

---